/*
 * (C) Copyright 2015 Hewlett Packard Enterprise Development LP.
 * (C) Copyright 2000-2014 Hewlett-Packard Development Company, L.P.
 * 
 * This program is free software; you can redistribute it and/or 
 * modify it under the terms of the GNU General Public License as 
 * published by the Free Software Foundation; either version 2 of 
 * the License, or (at your option) any later version. 
 *
 * This program is distributed in the hope that it will be useful, 
 * but WITHOUT ANY WARRANTY; without even the implied warranty of 
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License 
 * along with this program; if not, write to the Free Software Foundation, 
 * Inc., 51 Franklin Street, Fifth Floor Boston, MA 02110-1301, USA. 
 *
 * likit.c	LInux Kernel Instrumentation
 *
 *		v7.3
 *		colin.honess@gmail.com
 *		mark.ray@hpe.com
 *		pokilfoyle@gmail.com
 *
 */

#include <linux/module.h>
#include <linux/init.h>
#include <linux/kernel.h>
#include <linux/fs.h>
#include <linux/cdev.h>
#include <linux/debugfs.h>
#include <linux/uaccess.h>
#include <linux/mm.h>
#include <linux/spinlock_types.h>
#include <linux/vmalloc.h>
#include <linux/kallsyms.h>
#include <linux/in.h>
#include <linux/file.h>
#include <linux/version.h>
#include <linux/kprobes.h>
#include <linux/stacktrace.h>
#include <linux/smp.h>
#include <net/sock.h>
#include <linux/profile.h>

#include <../arch/arm64/include/asm/unistd.h>
#include <../arch/arm64/include/asm/stacktrace.h>
#if LINUX_VERSION_CODE < KERNEL_VERSION(5,11,0)
#define	IS_32BIT(regs)	test_thread_flag(TIF_IA32)
#else
#define IS_32BIT(regs)  !user_64bit_mode(regs)
#endif

#elif defined CONFIG_PPC64
#include <../arch/powerpc/include/asm/unistd.h>
#include <../include/linux/stacktrace.h>
#if LINUX_VERSION_CODE < KERNEL_VERSION(5,11,0)
#define	IS_32BIT(regs)	test_thread_flag(TIF_IA32)
#else
#define IS_32BIT(regs)  !user_64bit_mode(regs)
#endif

#else
Confused about platform!
#endif

#ifndef NR_syscalls
#define NR_syscalls __NR_syscalls
#endif

/* liki.h holds definitions of the trace types and a few other
 * things that need to be shared with userspace consumers.
 */
#ifdef __LIKI_DEBUG
#define STATIC
#define INLINE
#else
#define STATIC static
#define INLINE inline
#endif
#include "liki.h"

#if LINUX_VERSION_CODE >= KERNEL_VERSION(5,5,0)
#define KTIME_GET       ktime_get_real_ts64
#else
#define KTIME_GET       getnstimeofday
#endif

/* Regular spinlocks may sleep in an RT kernel. From a trace 
 * perspective that is bad for a number of reasons. For those
 * spinlocks that might be used in the trace generation path
 * we use raw/arch spinlocks instead.
 */
#if LINUX_VERSION_CODE >= KERNEL_VERSION(3,0,0)

#define	real_spinlock_t			arch_spinlock_t
#define REAL_SPIN_LOCK_UNLOCKED		__ARCH_SPIN_LOCK_UNLOCKED
#define	real_spin_lock			arch_spin_lock
#define real_spin_unlock		arch_spin_unlock
#define real_spin_trylock		arch_spin_trylock

#else

#define	real_spinlock_t			raw_spinlock_t
#define REAL_SPIN_LOCK_UNLOCKED		__RAW_SPIN_LOCK_UNLOCKED
#define	real_spin_lock			__raw_spin_lock
#define real_spin_unlock		__raw_spin_unlock
#define real_spin_trylock		__raw_spin_trylock

#endif	// LINUX_VERSION_CODE >= KERNEL_VERSION(3,0,0)


/* The following pertain to stack unwinding (see below) */
#define HARDCLOCK_INTERVAL		10	/* profile timer ticks every 1ms, but we
						 * only collect hardclock traces every
						 * this many millieconds. If you don't
						 * want this throttling, do not define
						 * HARDCLOCK_INTERVAL.
						 */


/* Global data declarations
 *
 * I'm going to keep all global data together here so we can easily
 * ensure alignment, and ensure that read-only data is kept away from
 * read-write data. Note that x86 does adjacent line prefetching, so
 * one line can interfere with the next, so in some cases here I've
 * padded data to two cachelines.
 */

/* The tbuf structure is a per-CPU structure that manages a set of
 * per-CPU trace buffers. This is where we keep track of things like
 * where to find the buffer memory, and offsets for read and write.
 * The tbufs pointer itself is global and frequently read in the
 * performance path; it is never updated after initialization.
 * The memory containing the tbuf structures themselves is allocated
 * at run time, is aligned, and includes padding to enaure that no
 * two tbuf structures could collide in cache. 
 */
STATIC struct tbuf {
	/* First line frequently updated by trace generation code */
	char				*buffer;		/* 8 */
	volatile char 			*alloc_chunk;		/* 16 */
	volatile struct task_struct	*waiting_reader;	/* 24 */
	unsigned long			last_hardclock;		/* 32 */
	unsigned long			unused;
	unsigned long			cpu_seqno;		/* 48 */
	unsigned long 			tsc_offset;		/* 56 */
	volatile unsigned int		alloc_offset;		/* 60 */
	char				deferred_wakeup;	/* 61 */
	char				main_man;		/* 62 */
	char				padding_line1[2];	/* 63 */

	/* Second line updated occasionally by trace generation code */
	unsigned long			irq_time_start;		/* 72 */
	unsigned long			softirq_time_start;	/* 80 */
	unsigned long			stealtime_start;	/* 88 */
	unsigned long			prev_tsc_offset;	/* 96 */
	char				padding_line2[32];	/* 128 */

	/* Third line used more by reader */
	volatile char 			*read_chunk;		/* 136 */
	unsigned long			chunk_locks;		/* 144 */
	char				*sync_chunk;		/* 152 */
	struct task_struct	 	*rd_task;		/* 160 */
	struct dentry			*file;			/* 168 */
	real_spinlock_t			chunk_interlock;	/* 172 */
	char 				sync_reader_active;	/* 173 */
	char				buf_mem_type;		/* 174 */
	char 				padding_line3[18];	/* 192 */
} *tbufs ____cacheline_aligned_in_smp;

/*
 * MSR init, start, and stop arrays are read-only so can be shared among all CPUs... although
 * now that I think about it, I wonder if globals references are always a cache-miss?  Hmmm...
 * I'll have to revisit it, but for now let's assume we're Rock Stars. - pk
 */

#ifdef CONFIG_X86_64

struct MsrList msr_init[] = {
        { MSR_WRITE, MSR_PERF_GLBL_CTRL, 0x00, 0x00, 0x00},     // ia32_perf_global_ctrl: disable 4 PMCs & 3 FFCs
        { MSR_WRITE, MSR_PERF_FIXED_CTRL, 0x00, 0x00, 0x00},    // ia32_perf_fixed_ctr_ctrl: clean up FFC ctrls
        { MSR_WRITE, MSR_PMC0, 0x00, 0x00, 0x00},               // ia32_pmc0: zero value (35-5)
        { MSR_WRITE, MSR_PMC1, 0x00, 0x00, 0x00},               // ia32_pmc1: zero value (35-5)
        { MSR_WRITE, MSR_INSTR_RET, 0x00, 0x00, 0x00},          // ia32_fixed_ctr0: zero value (35-17)
        { MSR_WRITE, MSR_CLK_NOHALT_CORE, 0x00, 0x00, 0x00},    // ia32_fixed_ctr1: zero value (35-17)
        { MSR_WRITE, MSR_FIXED_CLKFREQ, 0x00, 0x00, 0x00},      // ia32_MPERF: zero value
        { MSR_WRITE, MSR_ACTUAL_CLKFREQ, 0x00, 0x00, 0x00},     // ia32_APERF: zero value
        { MSR_WRITE, MSR_PERFEVTSEL0, 0x00434f2e, 0x00, 0x00},  // ia32_perfevtsel0, LLC Reference
        { MSR_WRITE, MSR_PERFEVTSEL1, 0x0043412e, 0x00, 0x00},  // ia32_perfevtsel1, LLC Misses
        { MSR_WRITE, MSR_PERF_FIXED_CTRL, 0x333, 0x00, 0x00},   // ia32_perf_fixed_ctr_ctrl: ensure 3 FFCs enabled
        { MSR_WRITE, MSR_PERF_GLBL_CTRL, 0x0f, 0x07, 0x00},     // ia32_perf_global_ctrl: enable 4 PMCs & 3 FFCs
        { MSR_STOP, 0x00, 0x00, 0x00 }
};

struct MsrList msr_stop[] = {
        { MSR_WRITE, MSR_PERF_GLBL_CTRL, 0x00, 0x00, 0x00},     // ia32_perf_global_ctrl: disable 4 PMCs & 3 FFCs
        { MSR_WRITE, MSR_PERF_FIXED_CTRL, 0x00, 0x00, 0x00},    // ia32_perf_fixed_ctr_ctrl: clean up FFC ctrls
        { MSR_STOP, 0x00, 0x00, 0x00}
};

/*
 * The above two structs occupy 6 - 64 byte cachelines. The following aligned
 * pointer will be padded to cacheline boundary because of the aligned ptr
 * that immediately follows.
 */

STATIC struct msr_cpu {
        unsigned long                   cpuid;                  /*  8 */
        unsigned long                   enabled;                /* 16 */
        unsigned long                   init_smi_cnt;           /* 32 */
        char                            padding_line1[32];      /* 64 */
} *msr_cpu_list  ____cacheline_aligned_in_smp;

STATIC void msr_ops(struct MsrList *oplist);

#endif  // CONFIG_X86_64

STATIC struct timer_list *timer_lists ____cacheline_aligned_in_smp;

#if LINUX_VERSION_CODE >= KERNEL_VERSION(4,15,0) || (defined(CONFIG_PPC64) && (LINUX_VERSION_CODE >= KERNEL_VERSION(4,12,0)))
STATIC void hardclock_timer(struct timer_list *t);
#else
STATIC void hardclock_timer(unsigned long cpu);
#endif


/* Ideally we'll allocate buffers from physical memory; but on a system
 * with fragmented memory may fall back to allocating from virtual 
 * memory. We need to remember which so we can free it correctly.
 */
#define BUF_MEM_PC	42
#define BUF_MEM_VC	24

/* Mostly read-only global data */

#define	TRACING_DISABLED	0
#define TRACING_GLOBAL		1
#define	TRACING_RESOURCES	2

STATIC int		tracing_state ____cacheline_aligned_in_smp = TRACING_DISABLED;
STATIC unsigned long	enabled_features = 0;
